package com.github.bouyio.cyancore;

/**
 * This class is meant to be a test for build and version control systems.
 * DO NOT USE.
 * */
@Deprecated
public final class TestClass {
    /** Do not attempt to instantiate it either.*/
    private TestClass() {}
}

// Και αν ένα στίγμα αφήσω στον κόσμο αυτό,
// η θα σιωπή ακούγεται σαν μελοδία αστεροειδών,
// βίωμα εσωκλειστίας θα θέσω το έργο μου αυτό,
// κι ας λέγανε πως δε μου άξιζει το τέλος αυτό.
//
// Η έκφρασή μου δε φτάσει στους θνητούς που θυμάμαι 'γώ,
// αν και η σκέψη μου γυρνάει για αυτούς σαν αστικό,
// και αν την σκέψη αγκαλιάσει της ύπαρξης το κενό,
// βλέματα θα με αποδοκιμάζουν από παράθυρο κλειστό.
//
// Μάλλον η ψυχή μου πηδά το φράγμα της ανυπαρξίας,
// και αυτή είναι χροιά μιας καταθλιπτικής δηκαιολογίας.
// Αν οι οφθαλμοί σας έχουν φως για το ξέσπασμα αυτό,
// τότε ακόμη και στη ζωή μου βάζω όρκο ότι σας αγαπώ.
//
// 2025.05.27
// - bouyio <3