package com.github.bouyio.cyancore;

/**
 * This class is meant to be a test for build and version control systems.
 * DO NOT USE.
 * */
@Deprecated
public final class TestClass {
    /** Do not attempt to instantiate it either.*/
    private TestClass() {}
}

/*
 * 2025.10.17
 *
 *  Κι όμως μετά από δυο χρόνια περπατάω,
 *  παραπατώντας στη Ρόδων σιγοτραγουδάω,
 *  κι όμως έδωσα όρκο πως δεν ξαναμιλάω,
 *  ταπεινός στο πίατο περιμένω να φάω,
 *
 *  Σ' έναν άλλον κόσμο βρησκόμασταν αγγαλιά,
 *  λέξεις και φράσεις δεν έκφραζαν την αγάπη μου,
 *  σ' έναν άλλον κόσμο καθαρίζανε χαλιά,
 *  τα παιδιά πίναν ρετσίνες πανώ απ' την στάχτη μου
 *
 *  Σφήξε τον λαιμό σου αλλά μη το κάνεις θέμα,
 *  κόψε και τις φλέβες απλά άφησε το δέρμα,
 *  όλη συμβάλουν στη στιγμή που βήχω αίμα,
 *  απλά τότε η ευθύνη προσγηώνεται σε μένα.
 */
